In this video we will look at how to remove columns or rows from a dataset in pandas. We will come to understand the drop() method and the functionality of its parameters in detal

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
%cd /content/drive/My Drive/Colab Notebooks

/content/drive/My Drive/Colab Notebooks

In [4]:
import pandas as pd
data = pd.read_csv('data-titanic.csv', index_col=3)
data.head()

                                                    PassengerId  ...  Embarked
Name                                                             ...
Braund, Mr. Owen Harris                                       1  ...         S
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C
Heikkinen, Miss. Laina                                        3  ...         S
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  4  ...         S
Allen, Mr. William Henry                                      5  ...         S

[5 rows x 11 columns]

To remove a single column from our dataset, the pandas drop() method is used. The drop() method consists of 2 parameters. The first parameter is the name of the column that needs to be eliminated; The second parameter is the axis. This parameter tells the drop method whether it should drop a row or column and sets inplace to True, which tells the method to drop it from the original DataFrame itself.

In this example let's consider removing the ticket column

In [5]:
data.drop('Ticket', axis=1, inplace=True)
data.head()

                                                    PassengerId  ...  Embarked
Name                                                             ...
Braund, Mr. Owen Harris                                       1  ...         S
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C
Heikkinen, Miss. Laina                                        3  ...         S
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  4  ...         S
Allen, Mr. William Henry                                      5  ...         S

[5 rows x 10 columns]

If we observe closely, it is clear that the Ticket column has been removed or dropped from our dataset. 


To remove multiple columns we pass the ones that need to be dropped as a list to the drop() method. All the other parameters of the drop() method will stay the same.

In this example we will drop multiple rows. Thus instead of passing the column names, we will pass the row index labels in the form of a list.

In [7]:
data.drop(['Parch', 'Fare'], axis=1, inplace=True)
data.head()

                                                    PassengerId  ...  Embarked
Name                                                             ...
Braund, Mr. Owen Harris                                       1  ...         S
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C
Heikkinen, Miss. Laina                                        3  ...         S
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  4  ...         S
Allen, Mr. William Henry                                      5  ...         S

[5 rows x 8 columns]

As a reulst, the two ros which corresponds to the names of the passengers passed to the drop() method will be taken off the dataset.